---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCData.SetSimpleType(System.String)
source: html/58125e02-7c82-9038-2572-170926ca90ee.htm
---
# Autodesk.Revit.DB.IFC.IFCData.SetSimpleType Method

Sets the corresponding IFC type by its name.

## Syntax (C#)
```csharp
public void SetSimpleType(
	string typeName
)
```

## Parameters
- **typeName** (`System.String`) - The name of the type.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null